<a href="https://colab.research.google.com/github/akileshprabhugithub/INTERNSOFTcodefiles/blob/master/SESSION9_pandas2codefile.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np 
import pandas as pd

In [6]:
 pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

from a 2-d numpy array

In [9]:
pd.DataFrame(np.random.randint(2,12),
columns = ['spam','eggs'],
index = ['a','b','c'])

   spam  eggs
a     4     4
b     4     4
c     4     4

pandas index object

In [10]:
ind = pd.Index([20,30,40,50,60])
ind

Int64Index([20, 30, 40, 50, 60], dtype='int64')

index as immutable array

In [11]:
ind[1]

30

In [12]:
ind[::]

Int64Index([20, 30, 40, 50, 60], dtype='int64')

In [13]:
ind[::-1]

Int64Index([60, 50, 40, 30, 20], dtype='int64')

In [15]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

5 (5,) 1 int64

In [16]:
print(type(ind))

<class 'pandas.core.indexes.numeric.Int64Index'>

In [ ]:
ind[1] = 0  #index is immutable

ufuncs:index preservation

In [23]:
abc = np.random.RandomState(10)
ser = pd.Series(abc.randint(0,10,4))
ser

0    9
1    4
2    0
3    1
dtype: int64

In [27]:
dfr = pd.DataFrame(abc.randint(0,10,(5,4)),
columns = ['a','b','c','d'])
dfr

   a  b  c  d
0  7  1  4  0
1  8  5  4  7
2  8  8  2  6
3  2  8  8  6
4  6  5  6  0

In [28]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

In [29]:
np.sin(dfr*np.pi/4)

              a             b             c         d
0 -7.071068e-01  7.071068e-01  1.224647e-16  0.000000
1 -2.449294e-16 -7.071068e-01  1.224647e-16 -0.707107
2 -2.449294e-16 -2.449294e-16  1.000000e+00 -1.000000
3  1.000000e+00 -2.449294e-16 -2.449294e-16 -1.000000
4 -1.000000e+00 -7.071068e-01 -1.000000e+00  0.000000

universal functions : index alignment

In [30]:
area =pd.Series({'alaska':3467743, 'texas':4579643,'california':6864462},name = 'area')
population = pd.Series({'california':557433849,'texas':367853858,'new york':844278646},name = 'population')
print(area)
population

alaska        3467743
texas         4579643
california    6864462
Name: area, dtype: int64

california    557433849
texas         367853858
new york      844278646
Name: population, dtype: int64

In [31]:
population / area

alaska              NaN
california    81.205759
new york            NaN
texas         80.323697
dtype: float64

In [32]:
area.index | population.index

Index(['alaska', 'california', 'new york', 'texas'], dtype='object')

In [33]:
a = pd.Series([2,4,6],index = [0,1,2])
b = pd.Series([1,3,5],index = [1,2,3])
print(a,b)
b
a+b

0    2
1    4
2    6
dtype: int64 1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [35]:
a.add(b, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [41]:
data = {'book_name':['Wish I Could Tell You','The One You Cannot Have','Will You Still Love Me?','Cosmos'],
        'year' :[2019,2018,2016,2017],
        'author' :['Durjoy Datta','Preeti Shenoy','Ravinder Singh','Carl Sagan']}
print(data)
print(type(data))
pd.DataFrame(data)

{'book_name': ['Wish I Could Tell You', 'The One You Cannot Have', 'Will You Still Love Me?', 'Cosmos'], 'year': [2019, 2018, 2016, 2017], 'author': ['Durjoy Datta', 'Preeti Shenoy', 'Ravinder Singh', 'Carl Sagan']}
<class 'dict'>

                 book_name  year          author
0    Wish I Could Tell You  2019    Durjoy Datta
1  The One You Cannot Have  2018   Preeti Shenoy
2  Will You Still Love Me?  2016  Ravinder Singh
3                   Cosmos  2017      Carl Sagan

In [43]:
 df = pd.DataFrame(data,columns=['book_name','author','year'])
df

                 book_name          author  year
0    Wish I Could Tell You    Durjoy Datta  2019
1  The One You Cannot Have   Preeti Shenoy  2018
2  Will You Still Love Me?  Ravinder Singh  2016
3                   Cosmos      Carl Sagan  2017

In [44]:
 df['genre'] = ['fiction','romance fiction','romance fiction','fiction']
df

                 book_name          author  year            genre
0    Wish I Could Tell You    Durjoy Datta  2019          fiction
1  The One You Cannot Have   Preeti Shenoy  2018  romance fiction
2  Will You Still Love Me?  Ravinder Singh  2016  romance fiction
3                   Cosmos      Carl Sagan  2017          fiction

In [45]:
df['serie_aligned'] =pd.Series(range(4),index=[0,1,2,3])
df

                 book_name          author  ...            genre serie_aligned
0    Wish I Could Tell You    Durjoy Datta  ...          fiction             0
1  The One You Cannot Have   Preeti Shenoy  ...  romance fiction             1
2  Will You Still Love Me?  Ravinder Singh  ...  romance fiction             2
3                   Cosmos      Carl Sagan  ...          fiction             3

[4 rows x 5 columns]

In [49]:
df2 = pd.DataFrame({"author" : ['Durjoy Datta','Preeti Shenoy','Ravinder Singh','Carl Sagan'],"no_of_books":['18','15','11','8']})
df2

           author no_of_books
0    Durjoy Datta          18
1   Preeti Shenoy          15
2  Ravinder Singh          11
3      Carl Sagan           8

In [54]:
df.merge(df2)

                 book_name          author  ...  serie_aligned no_of_books
0    Wish I Could Tell You    Durjoy Datta  ...              0          18
1  The One You Cannot Have   Preeti Shenoy  ...              1          15
2  Will You Still Love Me?  Ravinder Singh  ...              2          11
3                   Cosmos      Carl Sagan  ...              3           8

[4 rows x 6 columns]

In [56]:
df3 = pd.DataFrame({"author":['Durjoy Datta','Preeti Shenoy'],"no_of_books":['18','15']})
df3
df.merge(df3, right_on ="author", left_on="author")

                 book_name         author  ...  serie_aligned no_of_books
0    Wish I Could Tell You   Durjoy Datta  ...              0          18
1  The One You Cannot Have  Preeti Shenoy  ...              1          15

[2 rows x 6 columns]

In [57]:
df4 = pd.DataFrame({"author":['Durjoy Datta','Preeti Shenoy',"Chetan Bhagat"],'no_of_books':['18','15','12']})
df.merge(df4,how= 'outer')

                 book_name          author  ...  serie_aligned no_of_books
0    Wish I Could Tell You    Durjoy Datta  ...            0.0          18
1  The One You Cannot Have   Preeti Shenoy  ...            1.0          15
2  Will You Still Love Me?  Ravinder Singh  ...            2.0         NaN
3                   Cosmos      Carl Sagan  ...            3.0         NaN
4                      NaN   Chetan Bhagat  ...            NaN          12

[5 rows x 6 columns]

In [61]:
df5 = pd.DataFrame({"author":['Durjoy Datta','Preeti Shenoy',"Durjoy Datta"],'no_of_books':['18','15','20']})
print(df)
df.merge(df5,how='outer')

                 book_name          author  ...            genre serie_aligned
0    Wish I Could Tell You    Durjoy Datta  ...          fiction             0
1  The One You Cannot Have   Preeti Shenoy  ...  romance fiction             1
2  Will You Still Love Me?  Ravinder Singh  ...  romance fiction             2
3                   Cosmos      Carl Sagan  ...          fiction             3

[4 rows x 5 columns]

                 book_name          author  ...  serie_aligned no_of_books
0    Wish I Could Tell You    Durjoy Datta  ...              0          18
1    Wish I Could Tell You    Durjoy Datta  ...              0          20
2  The One You Cannot Have   Preeti Shenoy  ...              1          15
3  Will You Still Love Me?  Ravinder Singh  ...              2         NaN
4                   Cosmos      Carl Sagan  ...              3         NaN

[5 rows x 6 columns]

 combining data with ovelap

In [75]:
ser_a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])
ser_b = pd.Series(np.arange(len(ser_a),dtype=np.float64),index= ['f','e','d','c','b','a'])
ser_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [76]:
ser_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [78]:
pd.Series(np.where(pd.isnull(ser_a),ser_b,ser_a),index=ser_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [79]:
ser_a.combine_first(ser_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64